line1=Настраиваемые параметры,11
zone_style=Способ установки часового пояса,4,linux-Linux,freebsd-FreeBSD,solaris-Solaris,-<Не поддерживается на этой ОС>
hwclock_flags=Параметры командной строки для аппаратных часов,10,-Нет,sysconfig-Из файла /etc/sysconfig/clock
ntp_only=Для синхронизации времени использовать только NTP?,1,1-Да,0-Нет
timeserver=Сервер времени по умолчанию,3,Нет
line2=Системные параметры,11
seconds=Формат системного времени,1,1-ММДДЧЧММГГГГ.СС,0-ММДДЧЧММГГ,2-ГГГГММДДЧЧММ.СС
lease=Допустимое расхождение между системным и аппаратным временем в секундах,0
